{
  "projects": [
    {
      "name": "Agrume",
      "baseline": "API development made for front-end developers.",
      "description": "Front-end developers are often afraid of the backend. They don't know how to start, what to do, and how to do it. Agrume is a tool that makes developing API endpoints as easy as writing a function. Best of all, it's type-safe!  I built this tool to help my teams at school to develop our prototypes faster by making it easier to use a feature-based structure.",
      "github": "https://github.com/arthur-fontaine/agrume/",
      "website": "https://agrume.js.org/",
      "color": "#1DBC4A",
      "tags": [
        "Typescript",
        "Node.js",
        "Babel",
        "Vite",
        "NPM"
      ]
    },
    {
      "name": "Diabolo",
      "baseline": "Simple, cross-platform, no external dependencies, and type-safe dependency injection library.",
      "description": "I was missing a library to inject dependencies in my projects running on different platforms (Node.js, browser, React Native).  I wanted a library that was very straightforward to use but didn't find any that met my needs.  The closest I found was Effect, but it was too complex for my use case.  So I decided to create my own tool.",
      "github": "https://github.com/arthur-fontaine/diabolo/",
      "website": "https://diabolo.js.org/",
      "color": "#95040F",
      "tags": [
        "Typescript",
        "JSR"
      ]
    },
    {
      "name": "Karmine Plus",
      "baseline": "An application to track the results, the next games, the leaderboards, and the players of Karmine Corp.",
      "description": "Karmine Plus is an unofficial application that allows you to follow the results, the next games, the leaderboards, and the players of Karmine Corp.  I built this application with my friends.  We wanted to be able to have a centralized place to get all the information about Karmine Corp.",
      "github": "https://github.com/wanned/karmine-corp-app/",
      "color": "#074984",
      "tags": [
        "React Native",
        "Typescript",
        "Expo",
        "Effect",
        "Firebase",
        "Node.js"
      ]
    }
  ]
}